{
    "en": {
        "vision": "Vision",
        "services": "Services",
        "kind-of-services": "What kind of Service do you need?",
        "testimonials": "Testimonials",
        "about-me": "About Me",
        "experience": "Experience",
        "education": "Education",
        "online_tutoring": "Online Tutoring for the Whole World",
        "contacts": "Contacts",
        "title": "Mathematics Tutoring",
        "quote-text": "\"With a Master's degree in Mathematics and an international career in private education, I offer my deep expertise and passion for teaching, whether in person or online. Turning challenges into achievements is my goal, and seeing my students succeed is my greatest reward.\"",
        "subtitle": "Personalized Assistance for Students of All Ages, In-Person and Online",
        "autonomy": "Autonomy",
        "critical_thinking": "Critical Thinking",
        "mathematical_literacy": "Mathematical Literacy",
        "academic_guidance": "Academic Guidance",
        "academic_guidance_description": "Academic guidance description",
        "math_tutoring": "Math Tutoring",
        "math_tutoring_description": "Elementary, secondary, and university education",
        "exam_preparation": "Exam Preparation",
        "exam_preparation_description": "National and international exams",
        "exam_and_assignements_review": "Review of exams and assignments",
        "exam_and_assignements_review_description": "Review of exams and assignments description",
        "experienced": "Experienced",
        "experienced_description": "With experience teaching at private schools, Irina brings a global and diverse perspective to mathematics education.",
        "qualified": "Qualified",
        "qualified_description": "Holding a Master’s degree in Mathematics, Irina offers solid and up-to-date knowledge in the field, essential for delivering detailed and effective explanations.",
        "dedicated": "Dedicated",
        "dedicated_description": "With years of private tutoring practice, Irina has developed a personalized methodology that adapts to each student’s individual needs, resulting in consistent academic success.",
        "current_role": "2016 - Present",
        "independent_tutor": "Independent Mathematics Tutor (In-person and Online)",
        "september_2015_june_2016": "September 2015 - June 2016",
        "teaching_internship": "Teaching Internship at Dr. Mário Sacramento Secondary School",
        "september_2014_june_2015": "September 2014 - June 2015",
        "bilingual_teacher_fontana": "Bilingual Mathematics Teacher (6th and 7th Grades) at Gimnásio Fontana",
        "january_2014_september_2014": "January 2014 - September 2014",
        "math_coordinator_britanico": "Mathematics Coordinator (Primary Education) at Gimnásio Británico",
        "august_2013_september_2014": "August 2013 - September 2014",
        "bilingual_teacher_britanico": "Bilingual Mathematics Teacher (3rd Grade) at Gimnásio Británico",
        "masters_education": "Master’s in Mathematical Education (Basic and Secondary Education)",
        "thesis": "Thesis: Critical Thinking and Mathematical Literacy: A Case Study in an 8th Grade Classroom",
        "internship_location": "Internship: Dr. Mário Sacramento School",
        "supervisors": "Supervisors: Prof. Isabel Brás and Prof. Maria João Naia",
        "bachelor_mathematics": "Bachelor’s Degree in Advanced Mathematics",
        "masters_management": "Master’s in Management",
        "current_role_description": "Utilizing all of her extensive prior experience to the fullest, Irina now develops personalized lesson plans, adapts teaching methods to individual students' needs, and employs advanced techniques to identify and address specific academic challenges. Additionally, she applies effective methodologies acquired over the years to foster not only academic progress but also the personal and emotional development of her students, with proven results.",
        "teaching_internship_description": "Irina served as a classroom teacher, and her main duties and responsibilities included planning mathematics lessons in English, teaching classes, and monitoring the academic progress of all students.",
        "bilingual_teacher_fontana_description": "Irina was a classroom teacher, and her primary duties and responsibilities included planning mathematics lessons in English, teaching classes, monitoring the academic progress of all students, developing and implementing academic assessments, creating remedial activities for students with academic difficulties, participating in meetings with students' parents, reporting unusual student situations, and maintaining records of student progress and attendance.",
        "math_coordinator_britanico_description": "As her main duties and responsibilities, she provided educational leadership through the development and promotion of the school's vision, encouraging teachers to share the school's vision and goals, overseeing programs, assisting in exam, test, and assignment preparation, guiding teachers in data collection and analysis, developing action plans in response to identified student needs, and organizing and conducting regular departmental meetings.",
        "bilingual_teacher_britanico_description": "She was a classroom teacher, planned mathematics lessons in English, taught classes, monitored academic progress for all students, developed and implemented academic assessments, participated in meetings with students' parents, reported unusual student situations, and maintained records of student progress and attendance.",
        "advanced_math_student": "Advanced Mathematics Student at the University of Aveiro",
        "advanced_math_student_description": "Experimental text",
        "online_description": "Math lessons accessible from anywhere in the world! Personalized classes, flexible schedules, and an interactive online environment with everything you need to learn at your own pace.",
        "online_point_1": "🌍 Lessons in multiple languages (Portuguese and English)",
        "online_point_2": "🕒 Flexible schedules for different time zones",
        "online_point_3": "💻 Platforms: Zoom, Google Meet, Miro, and more",
        "schedule_online_class": "Schedule Online Class",
        "contact-me": "Contact me",
        "schedule-class": "Schedule a class"
    },
    "pt": {
        "vision": "Visão",
        "services": "Serviços",
        "kind-of-services": "Que tipo de Serviço precisas?",
        "testimonials": "Testemunhos",
        "about-me": "Sobre Mim",
        "experience": "Experiência",
        "education": "Educação",
        "online_tutoring": "Explicações Online para Todo o Mundo",
        "contacts": "Contactos",
        "title": "Tutorias de Matemática",
        "quote-text": "O trabalho de investigação nas áreas de Pensamento Crítico e Literacia Matemática, aliado à experiência em colégios internacionais, tem-me permitido transformar os desafios e dificuldades dos alunos em conquistas e aprendizagens significativas para o seu futuro. O sucesso deles é a minha maior recompensa.",
        "subtitle": "Apoio Personalizado para Alunos de Todas as Idades, Presencial e Online",
        "autonomy": "Autonomia",
        "critical_thinking": "Pensamento Crítico",
        "mathematical_literacy": "Literacia Matemática",
        "academic_guidance": "Orientação Académica",
        "academic_guidance_description": "Descrição da orientação académica",
        "math_tutoring": "Tutoria Matemática",
        "math_tutoring_description": "Ensino básico, secundário e universitário",
        "exam_preparation": "Preparação para Exames",
        "exam_preparation_description": "Exames nacionais e internacionais",
        "exam_and_assignements_review": "Revisão de provas e trabalhos",
        "exam_and_assignements_review_description": "Descrição da revisão de Provas e Trabalhos",
        "experienced": "Experiente",
        "experienced_description": "Possuo uma experiência de ensino em várias instituições educativas que me permite ter uma perspectiva global e diversificada do ensino, em particular da área de Matemática.",
        "qualified": "Qualificada",
        "qualified_description": "Tenho um Mestrado no Ensino de Matemática que me garante um conhecimento sólido e atualizado na disciplina, essencial para oferecer orientações detalhadas e eficazes.",
        "dedicated": "Dedicada",
        "dedicated_description": "A experência no ensino particular permitiu-me desenvolver uma metodologia de trabalho personalizada, capaz de se adaptar às necessidades individuais de cada aluno e promotora de sucessos académicos consistentes.",
        "current_role": "2016 - Presente",
        "independent_tutor": "Tutora académica",
        "september_2015_june_2016": "Setembro 2015 - Junho 2016",
        "teaching_internship": "Estágio na Escola Secundária Dr. Mário Sacramento", 
        "september_2014_june_2015": "Setembro 2014 - Junho 2015",
        "january_2014_september_2014": "Janeiro 2014 - Setembro 2014",
        "bilingual_teacher_fontana": "Professora Bilíngue de Matemática (6º e 7º ano) no Gimnásio Fontana",
        "math_coordinator_britanico": "Coordenadora de Matemática (Ensino Primário) no Gimnásio Británico",
        "august_2013_september_2014": "Agosto 2013 - Setembro 2014",
        "bilingual_teacher_britanico": "Professora Bilíngue de Matemática (3º ano) no Gimnásio Británico",
        "masters_education": "Mestrado em Ensino de Matemática no 3.º Ciclo do Ensino Básico e no Ensino Secundário",
        "thesis": "Projeto de investigação - Pensamento Crítico e Literacia Matemática: um estudo de caso numa turma do 8º ano",
        "internship_location": "Estágio: Escola Dr. Mário Sacramento",
        "supervisors": "Orientadores: Prof. Isabel Brás e Prof. Maria João Naia",
        "bachelor_mathematics": "Licenciatura em Matemática",
        "masters_management": "Menor em Gestão",
        "current_role_description": "Utilizando toda a sua vasta experiência anterior de forma integral, atualmente a Irina desenvolve planos de aula personalizados, adapta o método de ensino às necessidades individuais dos alunos e utiliza técnicas avançadas para identificar e resolver dificuldades académicas específicas. Além disso, aplica metodologias eficazes adquiridas ao longo dos anos para promover não apenas o progresso académico, mas também o desenvolvimento pessoal e emocional dos seus alunos, com resultados comprovados.",
        "teaching_internship_description": "A Irina foi professora titular de turma e os seus principais deveres e responsabilidades passaram por planear aulas de matemática em inglês, lecionar aulas, realizar monitoramento académico de todos os alunos.",
        "bilingual_teacher_fontana_description": "A Irina foi professora titular de turma e os seus principais deveres e responsabilidades passaram por planear aulas de matemática em inglês, lecionar aulas, realizar monitoramento académico de todos os alunos, desenvolver e aplicar avaliações académicas, desenvolver atividades de reforço para alunos com dificuldades académicas, participar em reuniões com os pais dos alunos e relatar situações incomuns dos alunos e manter relatórios de progresso e assiduidade dos alunos.",
        "math_coordinator_britanico_description": "Como principais deveres e responsabilidades, forneceu liderança educacional através do desenvolvimento e promoção da visão da escola e encorajamento dos professores a partilharem a visão e objetivos da escola, supervisionou programas, auxiliou na preparação de exames, testes e tarefas, orientou os professores na coleta e análise de dados e desenvolveu planos de ação em resposta às necessidades dos alunos identificadas, organizou e conduziu reuniões regulares do departamento.",
        "bilingual_teacher_britanico_description": "Foi professora titular de turma, planeou aulas de matemática em inglês, lecionou aulas, realizou monitoramento académico para todos os alunos, desenvolveu e aplicou avaliações académicas; participou em reuniões com os pais dos alunos e relatou situações incomuns dos alunos, manteve relatórios de progresso e assiduidade dos alunos.",
        "advanced_math_student": "Estudante de Matemática Avançada na Universidade de Aveiro",
        "advanced_math_student_description": "Texto experimental",
        "online_description": "Explicações de Matemática acessíveis em qualquer parte do mundo! Aulas personalizadas, horários flexíveis, e um ambiente online interativo com tudo o que precisas para aprender ao teu ritmo.",
        "online_point_1": "🌍 Explicações em várias línguas (Português e Inglês)",
        "online_point_2": "🕒 Horários flexíveis para diferentes fusos horários",
        "online_point_3": "💻 Plataformas: Zoom, Google Meet, Miro e muito mais",
        "schedule_online_class": "Agendar Aula Online",
        "contact-me": "Contacta-me",
        "schedule-class": "Agenda uma aula"
    }
}